chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/tmr/processor/tmr_p32mz1024ech144.h
PLIB_INLINE SFR_DATA _TMR_PERIOD_REGISTER_16BIT_POS(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_DATA)0;
        case TMR_ID_2 :
            return (SFR_DATA)0;
        case TMR_ID_4 :
            return (SFR_DATA)0;
        case TMR_ID_6 :
            return (SFR_DATA)0;
        case TMR_ID_8 :
            return (SFR_DATA)0;
        case TMR_ID_3 :
            return (SFR_DATA)0;
        case TMR_ID_5 :
            return (SFR_DATA)0;
        case TMR_ID_7 :
            return (SFR_DATA)0;
        case TMR_ID_9 :
            return (SFR_DATA)0;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_PERIOD_MATCH_MODE_POS(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_DATA)0;
        case TMR_ID_2 :
            return (SFR_DATA)0;
        case TMR_ID_4 :
            return (SFR_DATA)0;
        case TMR_ID_6 :
            return (SFR_DATA)0;
        case TMR_ID_8 :
            return (SFR_DATA)0;
        case TMR_ID_3 :
            return (SFR_DATA)0;
        case TMR_ID_5 :
            return (SFR_DATA)0;
        case TMR_ID_7 :
            return (SFR_DATA)0;
        case TMR_ID_9 :
            return (SFR_DATA)0;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_VALUE_REGISTER_16BIT_POS(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_DATA)0;
        case TMR_ID_2 :
            return (SFR_DATA)0;
        case TMR_ID_4 :
            return (SFR_DATA)0;
        case TMR_ID_6 :
            return (SFR_DATA)0;
        case TMR_ID_8 :
            return (SFR_DATA)0;
        case TMR_ID_3 :
            return (SFR_DATA)0;
        case TMR_ID_5 :
            return (SFR_DATA)0;
        case TMR_ID_7 :
            return (SFR_DATA)0;
        case TMR_ID_9 :
            return (SFR_DATA)0;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_MODE_16BIT_POS(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_DATA)-1;
        case TMR_ID_2 :
            return _T2CON_T32_POSITION;
        case TMR_ID_4 :
            return _T4CON_T32_POSITION;
        case TMR_ID_6 :
            return _T6CON_T32_POSITION;
        case TMR_ID_8 :
            return _T8CON_T32_POSITION;
        case TMR_ID_3 :
            return (SFR_DATA)-1;
        case TMR_ID_5 :
            return (SFR_DATA)-1;
        case TMR_ID_7 :
            return (SFR_DATA)-1;
        case TMR_ID_9 :
            return (SFR_DATA)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_MODE_32BIT_POS(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_DATA)-1;
        case TMR_ID_2 :
            return _T2CON_T32_POSITION;
        case TMR_ID_4 :
            return _T4CON_T32_POSITION;
        case TMR_ID_6 :
            return _T6CON_T32_POSITION;
        case TMR_ID_8 :
            return _T8CON_T32_POSITION;
        case TMR_ID_3 :
            return (SFR_DATA)-1;
        case TMR_ID_5 :
            return (SFR_DATA)-1;
        case TMR_ID_7 :
            return (SFR_DATA)-1;
        case TMR_ID_9 :
            return (SFR_DATA)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_PERIOD_REGISTER_16BIT_LOW_32_POS(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_DATA)-1;
        case TMR_ID_2 :
            return (SFR_DATA)0;
        case TMR_ID_4 :
            return (SFR_DATA)0;
        case TMR_ID_6 :
            return (SFR_DATA)0;
        case TMR_ID_8 :
            return (SFR_DATA)0;
        case TMR_ID_3 :
            return (SFR_DATA)-1;
        case TMR_ID_5 :
            return (SFR_DATA)-1;
        case TMR_ID_7 :
            return (SFR_DATA)-1;
        case TMR_ID_9 :
            return (SFR_DATA)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_VALUE_REGISTER_16BIT_LOW_POS(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_DATA)-1;
        case TMR_ID_2 :
            return (SFR_DATA)0;
        case TMR_ID_4 :
            return (SFR_DATA)0;
        case TMR_ID_6 :
            return (SFR_DATA)0;
        case TMR_ID_8 :
            return (SFR_DATA)0;
        case TMR_ID_3 :
            return (SFR_DATA)-1;
        case TMR_ID_5 :
            return (SFR_DATA)-1;
        case TMR_ID_7 :
            return (SFR_DATA)-1;
        case TMR_ID_9 :
            return (SFR_DATA)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_PERIOD_REGISTER_16BIT_HIGH_POS(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_DATA)-1;
        case TMR_ID_2 :
            return (SFR_DATA)-1;
        case TMR_ID_4 :
            return (SFR_DATA)-1;
        case TMR_ID_6 :
            return (SFR_DATA)-1;
        case TMR_ID_8 :
            return (SFR_DATA)-1;
        case TMR_ID_3 :
            return (SFR_DATA)0;
        case TMR_ID_5 :
            return (SFR_DATA)0;
        case TMR_ID_7 :
            return (SFR_DATA)0;
        case TMR_ID_9 :
            return (SFR_DATA)0;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_VALUE_REGISTER_16BIT_HIGH_POS(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_DATA)-1;
        case TMR_ID_2 :
            return (SFR_DATA)-1;
        case TMR_ID_4 :
            return (SFR_DATA)-1;
        case TMR_ID_6 :
            return (SFR_DATA)-1;
        case TMR_ID_8 :
            return (SFR_DATA)-1;
        case TMR_ID_3 :
            return (SFR_DATA)0;
        case TMR_ID_5 :
            return (SFR_DATA)0;
        case TMR_ID_7 :
            return (SFR_DATA)0;
        case TMR_ID_9 :
            return (SFR_DATA)0;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_ENABLE_LEN(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_ON_LENGTH;
        case TMR_ID_2 :
            return _T2CON_ON_LENGTH;
        case TMR_ID_4 :
            return _T4CON_ON_LENGTH;
        case TMR_ID_6 :
            return _T6CON_ON_LENGTH;
        case TMR_ID_8 :
            return _T8CON_ON_LENGTH;
        case TMR_ID_3 :
            return _T3CON_ON_LENGTH;
        case TMR_ID_5 :
            return _T5CON_ON_LENGTH;
        case TMR_ID_7 :
            return _T7CON_ON_LENGTH;
        case TMR_ID_9 :
            return _T9CON_ON_LENGTH;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_STOP_IN_IDLE_LEN(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_SIDL_LENGTH;
        case TMR_ID_2 :
            return _T2CON_SIDL_LENGTH;
        case TMR_ID_4 :
            return _T4CON_SIDL_LENGTH;
        case TMR_ID_6 :
            return _T6CON_SIDL_LENGTH;
        case TMR_ID_8 :
            return _T8CON_SIDL_LENGTH;
        case TMR_ID_3 :
            return _T3CON_SIDL_LENGTH;
        case TMR_ID_5 :
            return _T5CON_SIDL_LENGTH;
        case TMR_ID_7 :
            return _T7CON_SIDL_LENGTH;
        case TMR_ID_9 :
            return _T9CON_SIDL_LENGTH;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_ASYNC_TIMER_WRITE_LEN(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_TWDIS_LENGTH;
        case TMR_ID_2 :
            return (SFR_DATA)-1;
        case TMR_ID_4 :
            return (SFR_DATA)-1;
        case TMR_ID_6 :
            return (SFR_DATA)-1;
        case TMR_ID_8 :
            return (SFR_DATA)-1;
        case TMR_ID_3 :
            return (SFR_DATA)-1;
        case TMR_ID_5 :
            return (SFR_DATA)-1;
        case TMR_ID_7 :
            return (SFR_DATA)-1;
        case TMR_ID_9 :
            return (SFR_DATA)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_COUNTER_ASYNC_WRITE_IN_PROGRESS_LEN(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_TWIP_LENGTH;
        case TMR_ID_2 :
            return (SFR_DATA)-1;
        case TMR_ID_4 :
            return (SFR_DATA)-1;
        case TMR_ID_6 :
            return (SFR_DATA)-1;
        case TMR_ID_8 :
            return (SFR_DATA)-1;
        case TMR_ID_3 :
            return (SFR_DATA)-1;
        case TMR_ID_5 :
            return (SFR_DATA)-1;
        case TMR_ID_7 :
            return (SFR_DATA)-1;
        case TMR_ID_9 :
            return (SFR_DATA)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_GATED_TIME_ACCUMULATION_LEN(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_TGATE_LENGTH;
        case TMR_ID_2 :
            return _T2CON_TGATE_LENGTH;
        case TMR_ID_4 :
            return _T4CON_TGATE_LENGTH;
        case TMR_ID_6 :
            return _T6CON_TGATE_LENGTH;
        case TMR_ID_8 :
            return _T8CON_TGATE_LENGTH;
        case TMR_ID_3 :
            return _T3CON_TGATE_LENGTH;
        case TMR_ID_5 :
            return _T5CON_TGATE_LENGTH;
        case TMR_ID_7 :
            return _T7CON_TGATE_LENGTH;
        case TMR_ID_9 :
            return _T9CON_TGATE_LENGTH;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_PRESCALE_LEN(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_TCKPS_LENGTH;
        case TMR_ID_2 :
            return _T2CON_TCKPS_LENGTH;
        case TMR_ID_4 :
            return _T4CON_TCKPS_LENGTH;
        case TMR_ID_6 :
            return _T6CON_TCKPS_LENGTH;
        case TMR_ID_8 :
            return _T8CON_TCKPS_LENGTH;
        case TMR_ID_3 :
            return _T3CON_TCKPS_LENGTH;
        case TMR_ID_5 :
            return _T5CON_TCKPS_LENGTH;
        case TMR_ID_7 :
            return _T7CON_TCKPS_LENGTH;
        case TMR_ID_9 :
            return _T9CON_TCKPS_LENGTH;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

